---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.KeynoteFailures.NotAssociatedKeynoteParameter
source: html/80e12ef6-3c0b-5912-aea4-71b7c89b0baa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.KeynoteFailures.NotAssociatedKeynoteParameter Property

Current tag keynoting system uses key value parameter that is not associated with this element category.\nTo resolve,
 associate parameter with category or change keynoting system.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotAssociatedKeynoteParameter { get; }
```